* CSV mode

#+begin_src emacs-lisp
    (use-package csv-mode
      :ensure t)
#+end_src

#+RESULTS:
: csv-mode

* color each column

#+begin_src emacs-lisp
  (require 'color)

(defun csv-highlight (&optional separator)
  (interactive (list (when current-prefix-arg (read-char "Separator: "))))
  (font-lock-mode 1)
  (let* ((separator (or separator ?\,))
         (n (count-matches (string separator) (pos-bol) (pos-eol)))
         (colors (cl-loop for i from 0 to 1.0 by (/ 2.0 n)
                          collect (apply #'color-rgb-to-hex 
                                         (color-hsl-to-rgb i 0.3 0.5)))))
    (cl-loop for i from 2 to n by 2 
             for c in colors
             for r = (format "^\\([^%c\n]+%c\\)\\{%d\\}" separator separator i)
             do (font-lock-add-keywords nil `((,r (1 '(face (:foreground ,c)))))))))

(add-hook 'csv-mode-hook 'csv-highlight)

(add-hook 'csv-mode-hook 'csv-align-mode)
#+end_src
* Fix the header
#+begin_src emacs-lisp
(add-hook 'csv-mode-hook #'csv-header-line)
#+end_src

#+RESULTS:
| csv-header-line | csv-align-mode | csv-highlight |
